FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/uart/fsl_adapter_usart.c
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "fsl_usart.h"
#include "fsl_flexcomm.h"

#include "fsl_adapter_uart.h"

#if ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) )
    #include "fsl_component_timer_manager.h"
    #include "fsl_usart_dma.h"
#endif /* HAL_UART_DMA_ENABLE */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#ifndef NDEBUG
    #if ( defined( DEBUG_CONSOLE_ASSERT_DISABLE ) && ( DEBUG_CONSOLE_ASSERT_DISABLE > 0U ) )
        #undef assert
        #define assert( n )
    #endif
#endif

#if ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) )
/*! @brief uart RX state structure. */
    typedef struct _hal_uart_dma_receive_state
    {
        uint8_t * volatile buffer;
        volatile uint32_t bufferLength;
        volatile uint32_t bufferSofar;
        volatile uint32_t timeout;
        volatile bool receiveAll;
    } hal_uart_dma_receive_state_t;

/*! @brief uart TX state structure. */
    typedef struct _hal_uart_dma_send_state
    {
        uint8_t * volatile buffer;
        volatile uint32_t bufferLength;
        volatile uint32_t bufferSofar;
        volatile uint32_t timeout;
    } hal_uart_dma_send_state_t;

    typedef struct _hal_uart_dma_state
    {
        struct _hal_uart_dma_state * next;
        uint8_t instance; /* USART instance */
        hal_uart_dma_transfer_callback_t dma_callback;
        void * dma_callback_param;
        usart_dma_handle_t dmaHandle;
        dma_handle_t txDmaHandle;
        dma_handle_t rxDmaHandle;
        hal_uart_dma_receive_state_t dma_rx;
        hal_uart_dma_send_state_t dma_tx;
    } hal_uart_dma_state_t;

    typedef struct _uart_dma_list
    {
        TIMER_MANAGER_HANDLE_DEFINE( timerManagerHandle );
        hal_uart_dma_state_t * dma_list;
        volatile int8_t activeCount;
    } hal_uart_dma_list_t;

    static hal_uart_dma_list_t s_dmaHandleList;
#endif /* HAL_UART_DMA_ENABLE */

#if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )
/*! @brief uart RX state structure. */
    typedef struct _hal_uart_receive_state
    {
        volatile uint8_t * buffer;
        volatile uint32_t bufferLength;
        volatile uint32_t bufferSofar;
    } hal_uart_receive_state_t;

/*! @brief uart TX state structure. */
    typedef struct _hal_uart_send_state
    {
        volatile uint8_t * buffer;
        volatile uint32_t bufferLength;
        volatile uint32_t bufferSofar;
    } hal_uart_send_state_t;
#endif /* if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) ) */
/*! @brief uart state structure. */
typedef struct _hal_uart_state
{
    #if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )
        hal_uart_transfer_callback_t callback;
        void * callbackParam;
        #if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) )
            usart_handle_t hardwareHandle;
        #endif
        hal_uart_receive_state_t rx;
        hal_uart_send_state_t tx;
    #endif
    uint8_t instance;
    #if ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) )
        hal_uart_dma_state_t * dmaHandle;
    #endif /* HAL_UART_DMA_ENABLE */
} hal_uart_state_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/
static USART_Type * const s_UsartAdapterBase[] = USART_BASE_PTRS;

#if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )

    #if !( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) )
/* Array of USART IRQ number. */
        static const IRQn_Type s_UsartIRQ[] = USART_IRQS;
    #endif

#endif

/*******************************************************************************
 * Code
 ******************************************************************************/

#if ( ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) ) || \
    ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) ) )
    static hal_uart_status_t HAL_UartGetStatus( status_t status )
    {
        hal_uart_status_t uartStatus = kStatus_HAL_UartError;

        switch( status )
        {
            case kStatus_Success:
                uartStatus = kStatus_HAL_UartSuccess;
                break;

            case kStatus_USART_TxBusy:
                uartStatus = kStatus_HAL_UartTxBusy;
                break;

            case kStatus_USART_RxBusy:
                uartStatus = kStatus_HAL_UartRxBusy;
                break;

            case kStatus_USART_TxIdle:
                uartStatus = kStatus_HAL_UartTxIdle;
                break;

            case kStatus_USART_RxIdle:
                uartStatus = kStatus_HAL_UartRxIdle;
                break;

            case kStatus_USART_BaudrateNotSupport:
                uartStatus = kStatus_HAL_UartBaudrateNotSupport;
                break;

            case kStatus_USART_NoiseError:
            case kStatus_USART_FramingError:
            case kStatus_USART_ParityError:
                uartStatus = kStatus_HAL_UartProtocolError;
                break;

            default:
                /* This comments for MISRA C-2012 Rule 16.4 */
                break;
        }

        return uartStatus;
    }
#else  /* if ( ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) ) || ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) ) ) */
    static hal_uart_status_t HAL_UartGetStatus( status_t status )
    {
        if( kStatus_Success == status )
        {
            return kStatus_HAL_UartSuccess;
        }
        else
        {
            return kStatus_HAL_UartError;
        }
    }
#endif /* if ( ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) ) || ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) ) ) */

