FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/uart/fsl_adapter_usart.c
#if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )

    #if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) )
        static void HAL_UartCallback( USART_Type * base,
                                      usart_handle_t * handle,
                                      status_t status,
                                      void * callbackParam )
        {
            hal_uart_state_t * uartHandle;
            hal_uart_status_t uartStatus = HAL_UartGetStatus( status );

            assert( callbackParam );

            uartHandle = ( hal_uart_state_t * ) callbackParam;

            if( kStatus_HAL_UartProtocolError == uartStatus )
            {
                if( 0U != uartHandle->hardwareHandle.rxDataSize )
                {
                    uartStatus = kStatus_HAL_UartError;
                }
            }

            if( NULL != uartHandle->callback )
            {
                uartHandle->callback( uartHandle, uartStatus, uartHandle->callbackParam );
            }
        }

    #else  /* if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) ) */
        static void HAL_UartInterruptHandle( USART_Type * base,
                                             void * handle )
        {
            hal_uart_state_t * uartHandle = ( hal_uart_state_t * ) handle;
            uint32_t status;
            uint8_t instance;

            if( NULL == uartHandle )
            {
                return;
            }

            instance = uartHandle->instance;

            status = USART_GetStatusFlags( s_UsartAdapterBase[ instance ] );

            /* Receive data register full */
            if( ( 0U != ( USART_FIFOSTAT_RXNOTEMPTY_MASK & status ) ) &&
                ( 0U != ( USART_GetEnabledInterrupts( s_UsartAdapterBase[ instance ] ) & USART_FIFOINTENSET_RXLVL_MASK ) ) )
            {
                if( NULL != uartHandle->rx.buffer )
                {
                    uartHandle->rx.buffer[ uartHandle->rx.bufferSofar++ ] = USART_ReadByte( s_UsartAdapterBase[ instance ] );

                    if( uartHandle->rx.bufferSofar >= uartHandle->rx.bufferLength )
                    {
                        USART_DisableInterrupts( s_UsartAdapterBase[ instance ],
                                                 USART_FIFOINTENCLR_RXLVL_MASK | USART_FIFOINTENCLR_RXERR_MASK );
                        uartHandle->rx.buffer = NULL;

                        if( NULL != uartHandle->callback )
                        {
                            uartHandle->callback( uartHandle, kStatus_HAL_UartRxIdle, uartHandle->callbackParam );
                        }
                    }
                }
            }

            /* Send data register empty and the interrupt is enabled. */
            if( ( 0U != ( USART_FIFOSTAT_TXNOTFULL_MASK & status ) ) &&
                ( 0U != ( USART_GetEnabledInterrupts( s_UsartAdapterBase[ instance ] ) & USART_FIFOINTENSET_TXLVL_MASK ) ) )
            {
                if( NULL != uartHandle->tx.buffer )
                {
                    USART_WriteByte( s_UsartAdapterBase[ instance ], uartHandle->tx.buffer[ uartHandle->tx.bufferSofar++ ] );

                    if( uartHandle->tx.bufferSofar >= uartHandle->tx.bufferLength )
                    {
                        USART_DisableInterrupts( s_UsartAdapterBase[ instance ], USART_FIFOINTENCLR_TXLVL_MASK );
                        uartHandle->tx.buffer = NULL;

                        if( NULL != uartHandle->callback )
                        {
                            uartHandle->callback( uartHandle, kStatus_HAL_UartTxIdle, uartHandle->callbackParam );
                        }
                    }
                }
            }

            #if 1
                USART_ClearStatusFlags( s_UsartAdapterBase[ instance ], status );
            #endif
        }

        static void HAL_UartInterruptHandle_Wapper( void * base,
                                                    void * handle )
        {
            HAL_UartInterruptHandle( ( USART_Type * ) base, handle );
        }
    #endif /* if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) ) */

#endif /* if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) ) */

static hal_uart_status_t HAL_UartInitCommon( hal_uart_handle_t handle,
                                             const hal_uart_config_t * config )
{
    usart_config_t usartConfig;
    status_t status;

    assert( handle );
    assert( config );
    assert( config->instance < ( sizeof( s_UsartAdapterBase ) / sizeof( USART_Type * ) ) );
    assert( s_UsartAdapterBase[ config->instance ] );
    assert( HAL_UART_HANDLE_SIZE >= sizeof( hal_uart_state_t ) );

    USART_GetDefaultConfig( &usartConfig );
    usartConfig.baudRate_Bps = config->baudRate_Bps;

    if( ( 0U != config->enableRxRTS ) || ( 0U != config->enableTxCTS ) )
    {
        usartConfig.enableHardwareFlowControl = true;
    }

    if( kHAL_UartParityEven == config->parityMode )
    {
        usartConfig.parityMode = kUSART_ParityEven;
    }
    else if( kHAL_UartParityOdd == config->parityMode )
    {
        usartConfig.parityMode = kUSART_ParityOdd;
    }
    else
    {
        usartConfig.parityMode = kUSART_ParityDisabled;
    }

    if( kHAL_UartTwoStopBit == config->stopBitCount )
    {
        usartConfig.stopBitCount = kUSART_TwoStopBit;
    }
    else
    {
        usartConfig.stopBitCount = kUSART_OneStopBit;
    }

    usartConfig.enableRx = ( bool ) config->enableRx;
    usartConfig.enableTx = ( bool ) config->enableTx;
    usartConfig.txWatermark = kUSART_TxFifo0;
    usartConfig.rxWatermark = kUSART_RxFifo1;

    status = USART_Init( s_UsartAdapterBase[ config->instance ], &usartConfig, config->srcClock_Hz );

    if( kStatus_Success != status )
    {
        return HAL_UartGetStatus( status );
    }

    return kStatus_HAL_UartSuccess;
}

hal_uart_status_t HAL_UartInit( hal_uart_handle_t handle,
                                const hal_uart_config_t * config )
{
    hal_uart_state_t * uartHandle;
    hal_uart_status_t status;

