FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/uart/fsl_adapter_usart.c
    /* Init serial port */
    status = HAL_UartInitCommon( handle, config );

    if( kStatus_HAL_UartSuccess != status )
    {
        return status;
    }

    uartHandle = ( hal_uart_state_t * ) handle;
    uartHandle->instance = config->instance;
    #if ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) )
        uartHandle->dmaHandle = NULL;
    #endif /* HAL_UART_DMA_ENABLE */

    #if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )
        #if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) )
            USART_TransferCreateHandle( s_UsartAdapterBase[ config->instance ], &uartHandle->hardwareHandle,
                                        ( usart_transfer_callback_t ) HAL_UartCallback, handle );
        #else
            /* Enable interrupt in NVIC. */
            FLEXCOMM_SetIRQHandler( s_UsartAdapterBase[ config->instance ], HAL_UartInterruptHandle_Wapper, handle );
            NVIC_SetPriority( ( IRQn_Type ) s_UsartIRQ[ config->instance ], HAL_UART_ISR_PRIORITY );
            ( void ) EnableIRQ( s_UsartIRQ[ config->instance ] );
        #endif
    #endif

    return kStatus_HAL_UartSuccess;
}

hal_uart_status_t HAL_UartDeinit( hal_uart_handle_t handle )
{
    hal_uart_state_t * uartHandle;

    assert( handle );

    uartHandle = ( hal_uart_state_t * ) handle;

    USART_Deinit( s_UsartAdapterBase[ uartHandle->instance ] );

    return kStatus_HAL_UartSuccess;
}

hal_uart_status_t HAL_UartReceiveBlocking( hal_uart_handle_t handle,
                                           uint8_t * data,
                                           size_t length )
{
    hal_uart_state_t * uartHandle;
    status_t status;

    assert( handle );
    assert( data );
    assert( length );

    uartHandle = ( hal_uart_state_t * ) handle;

    #if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )
        if( NULL != uartHandle->rx.buffer )
        {
            return kStatus_HAL_UartRxBusy;
        }
    #endif

    status = USART_ReadBlocking( s_UsartAdapterBase[ uartHandle->instance ], data, length );

    return HAL_UartGetStatus( status );
}

hal_uart_status_t HAL_UartSendBlocking( hal_uart_handle_t handle,
                                        const uint8_t * data,
                                        size_t length )
{
    hal_uart_state_t * uartHandle;

    assert( handle );
    assert( data );
    assert( length );

    uartHandle = ( hal_uart_state_t * ) handle;

    #if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )
        if( NULL != uartHandle->tx.buffer )
        {
            return kStatus_HAL_UartTxBusy;
        }
    #endif

    ( void ) USART_WriteBlocking( s_UsartAdapterBase[ uartHandle->instance ], data, length );

    return kStatus_HAL_UartSuccess;
}

hal_uart_status_t HAL_UartEnterLowpower( hal_uart_handle_t handle )
{
    assert( handle );

    return kStatus_HAL_UartSuccess;
}

hal_uart_status_t HAL_UartExitLowpower( hal_uart_handle_t handle )
{
    assert( handle );

    return kStatus_HAL_UartSuccess;
}

#if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) )

    #if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) )

        hal_uart_status_t HAL_UartTransferInstallCallback( hal_uart_handle_t handle,
                                                           hal_uart_transfer_callback_t callback,
                                                           void * callbackParam )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( 0U != HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            uartHandle->callbackParam = callbackParam;
            uartHandle->callback = callback;

            return kStatus_HAL_UartSuccess;
        }

        hal_uart_status_t HAL_UartTransferReceiveNonBlocking( hal_uart_handle_t handle,
                                                              hal_uart_transfer_t * transfer )
        {
            hal_uart_state_t * uartHandle;
            status_t status;

            assert( handle );
            assert( transfer );
            assert( 0U != HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            status = USART_TransferReceiveNonBlocking( s_UsartAdapterBase[ uartHandle->instance ], &uartHandle->hardwareHandle,
                                                       ( usart_transfer_t * ) transfer, NULL );

            return HAL_UartGetStatus( status );
        }

        hal_uart_status_t HAL_UartTransferSendNonBlocking( hal_uart_handle_t handle,
                                                           hal_uart_transfer_t * transfer )
        {
            hal_uart_state_t * uartHandle;
            status_t status;

            assert( handle );
            assert( transfer );
            assert( 0U != HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            status = USART_TransferSendNonBlocking( s_UsartAdapterBase[ uartHandle->instance ], &uartHandle->hardwareHandle,
                                                    ( usart_transfer_t * ) transfer );

            return HAL_UartGetStatus( status );
        }

        hal_uart_status_t HAL_UartTransferGetReceiveCount( hal_uart_handle_t handle,
                                                           uint32_t * count )
        {
            hal_uart_state_t * uartHandle;
            status_t status;

            assert( handle );
            assert( count );
            assert( 0U != HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            status =
                USART_TransferGetReceiveCount( s_UsartAdapterBase[ uartHandle->instance ], &uartHandle->hardwareHandle, count );

            return HAL_UartGetStatus( status );
        }

        hal_uart_status_t HAL_UartTransferGetSendCount( hal_uart_handle_t handle,
                                                        uint32_t * count )
        {
            hal_uart_state_t * uartHandle;
            status_t status;

            assert( handle );
            assert( count );
            assert( 0U != HAL_UART_TRANSFER_MODE );

