FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/uart/fsl_adapter_usart.c
            uartHandle = ( hal_uart_state_t * ) handle;

            status = USART_TransferGetSendCount( s_UsartAdapterBase[ uartHandle->instance ], &uartHandle->hardwareHandle, count );

            return HAL_UartGetStatus( status );
        }

        hal_uart_status_t HAL_UartTransferAbortReceive( hal_uart_handle_t handle )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( 0U != HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            USART_TransferAbortReceive( s_UsartAdapterBase[ uartHandle->instance ], &uartHandle->hardwareHandle );

            return kStatus_HAL_UartSuccess;
        }

        hal_uart_status_t HAL_UartTransferAbortSend( hal_uart_handle_t handle )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( 0U != HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            USART_TransferAbortSend( s_UsartAdapterBase[ uartHandle->instance ], &uartHandle->hardwareHandle );

            return kStatus_HAL_UartSuccess;
        }

    #else  /* if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) ) */

/* None transactional API with non-blocking mode. */
        hal_uart_status_t HAL_UartInstallCallback( hal_uart_handle_t handle,
                                                   hal_uart_transfer_callback_t callback,
                                                   void * callbackParam )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( 0U == HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            uartHandle->callbackParam = callbackParam;
            uartHandle->callback = callback;

            return kStatus_HAL_UartSuccess;
        }

        hal_uart_status_t HAL_UartReceiveNonBlocking( hal_uart_handle_t handle,
                                                      uint8_t * data,
                                                      size_t length )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( data );
            assert( length );
            assert( 0U == HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            if( NULL != uartHandle->rx.buffer )
            {
                return kStatus_HAL_UartRxBusy;
            }

            uartHandle->rx.bufferLength = length;
            uartHandle->rx.bufferSofar = 0;
            uartHandle->rx.buffer = data;
            USART_EnableInterrupts( s_UsartAdapterBase[ uartHandle->instance ], USART_FIFOINTENSET_RXLVL_MASK );
            return kStatus_HAL_UartSuccess;
        }

        hal_uart_status_t HAL_UartSendNonBlocking( hal_uart_handle_t handle,
                                                   uint8_t * data,
                                                   size_t length )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( data );
            assert( length );
            assert( 0U == HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            if( NULL != uartHandle->tx.buffer )
            {
                return kStatus_HAL_UartTxBusy;
            }

            uartHandle->tx.bufferLength = length;
            uartHandle->tx.bufferSofar = 0;
            uartHandle->tx.buffer = ( volatile uint8_t * ) data;
            USART_EnableInterrupts( s_UsartAdapterBase[ uartHandle->instance ], USART_FIFOINTENSET_TXLVL_MASK );
            return kStatus_HAL_UartSuccess;
        }

        hal_uart_status_t HAL_UartGetReceiveCount( hal_uart_handle_t handle,
                                                   uint32_t * reCount )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( reCount );
            assert( 0U == HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            if( NULL != uartHandle->rx.buffer )
            {
                *reCount = uartHandle->rx.bufferSofar;
                return kStatus_HAL_UartSuccess;
            }

            return kStatus_HAL_UartError;
        }

        hal_uart_status_t HAL_UartGetSendCount( hal_uart_handle_t handle,
                                                uint32_t * seCount )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( seCount );
            assert( 0U == HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            if( NULL != uartHandle->tx.buffer )
            {
                *seCount = uartHandle->tx.bufferSofar;
                return kStatus_HAL_UartSuccess;
            }

            return kStatus_HAL_UartError;
        }

        hal_uart_status_t HAL_UartAbortReceive( hal_uart_handle_t handle )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( 0U == HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            if( NULL != uartHandle->rx.buffer )
            {
                USART_DisableInterrupts( s_UsartAdapterBase[ uartHandle->instance ],
                                         USART_FIFOINTENCLR_RXLVL_MASK | USART_FIFOINTENCLR_RXERR_MASK );
                uartHandle->rx.buffer = NULL;
            }

            return kStatus_HAL_UartSuccess;
        }

        hal_uart_status_t HAL_UartAbortSend( hal_uart_handle_t handle )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( 0U == HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            if( NULL != uartHandle->tx.buffer )
            {
                USART_DisableInterrupts( s_UsartAdapterBase[ uartHandle->instance ], USART_FIFOINTENCLR_TXLVL_MASK );
                uartHandle->tx.buffer = NULL;
            }

            return kStatus_HAL_UartSuccess;
        }

    #endif /* if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) ) */

    #if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) )

        void HAL_UartIsrFunction( hal_uart_handle_t handle )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( 0U != HAL_UART_TRANSFER_MODE );

