FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/uart/fsl_adapter_usart.c
            uartHandle = ( hal_uart_state_t * ) handle;

            #if 0
                DisableIRQ( s_UsartIRQ[ uartHandle->instance ] );
            #endif
            USART_TransferHandleIRQ( s_UsartAdapterBase[ uartHandle->instance ], &uartHandle->hardwareHandle );
            #if 0
                NVIC_SetPriority( ( IRQn_Type ) s_UsartIRQ[ uartHandle->instance ], HAL_UART_ISR_PRIORITY );
                EnableIRQ( s_UsartIRQ[ uartHandle->instance ] );
            #endif
        }

    #else  /* if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) ) */

        void HAL_UartIsrFunction( hal_uart_handle_t handle )
        {
            hal_uart_state_t * uartHandle;

            assert( handle );
            assert( 0U == HAL_UART_TRANSFER_MODE );

            uartHandle = ( hal_uart_state_t * ) handle;

            #if 0
                DisableIRQ( s_UsartIRQ[ uartHandle->instance ] );
            #endif
            HAL_UartInterruptHandle( s_UsartAdapterBase[ uartHandle->instance ], ( void * ) uartHandle );
            #if 0
                NVIC_SetPriority( ( IRQn_Type ) s_UsartIRQ[ uartHandle->instance ], HAL_UART_ISR_PRIORITY );
                EnableIRQ( s_UsartIRQ[ uartHandle->instance ] );
            #endif
        }

    #endif /* if ( defined( HAL_UART_TRANSFER_MODE ) && ( HAL_UART_TRANSFER_MODE > 0U ) ) */

#endif /* if ( defined( UART_ADAPTER_NON_BLOCKING_MODE ) && ( UART_ADAPTER_NON_BLOCKING_MODE > 0U ) ) */

#if ( defined( HAL_UART_DMA_ENABLE ) && ( HAL_UART_DMA_ENABLE > 0U ) )
    static void USART_DMACallbacks( USART_Type * base,
                                    usart_dma_handle_t * handle,
                                    status_t status,
                                    void * userData )
    {
        hal_uart_dma_state_t * uartDmaHandle;
        hal_uart_status_t uartStatus = HAL_UartGetStatus( status );
        hal_dma_callback_msg_t msg;

        assert( handle );

        uartDmaHandle = ( hal_uart_dma_state_t * ) userData;

        if( NULL != uartDmaHandle->dma_callback )
        {
            if( kStatus_HAL_UartTxIdle == uartStatus )
            {
                msg.status = kStatus_HAL_UartDmaTxIdle;
                msg.data = uartDmaHandle->dma_tx.buffer;
                msg.dataSize = uartDmaHandle->dma_tx.bufferLength;
                uartDmaHandle->dma_tx.buffer = NULL;
            }
            else if( kStatus_HAL_UartRxIdle == uartStatus )
            {
                msg.status = kStatus_HAL_UartDmaRxIdle;
                msg.data = uartDmaHandle->dma_rx.buffer;
                msg.dataSize = uartDmaHandle->dma_rx.bufferLength;
                uartDmaHandle->dma_rx.buffer = NULL;
            }

            uartDmaHandle->dma_callback( uartDmaHandle, &msg, uartDmaHandle->dma_callback_param );
        }
    }

    static void TimeoutTimer_Callbcak( void * param )
    {
        hal_uart_dma_list_t * uartDmaHandleList;
        hal_uart_dma_state_t * uartDmaHandle;
        hal_dma_callback_msg_t msg;
        uint32_t newReceived = 0U;

        uartDmaHandleList = &s_dmaHandleList;
        uartDmaHandle = uartDmaHandleList->dma_list;

        while( NULL != uartDmaHandle )
        {
            if( ( NULL != uartDmaHandle->dma_rx.buffer ) && ( false == uartDmaHandle->dma_rx.receiveAll ) )
            {
                /* HAL_UartDMAGetReceiveCount(uartDmaHandle, &msg.dataSize); */
                USART_TransferGetReceiveCountDMA( s_UsartAdapterBase[ uartDmaHandle->instance ], &uartDmaHandle->dmaHandle,
                                                  &msg.dataSize );
                newReceived = msg.dataSize - uartDmaHandle->dma_rx.bufferSofar;
                uartDmaHandle->dma_rx.bufferSofar = msg.dataSize;

                /* 1, If it is in idle state. */
                if( ( 0U == newReceived ) && ( 0U < uartDmaHandle->dma_rx.bufferSofar ) )
                {
                    uartDmaHandle->dma_rx.timeout++;

                    if( uartDmaHandle->dma_rx.timeout >= HAL_UART_DMA_IDLELINE_TIMEOUT )
                    {
                        /* HAL_UartDMAAbortReceive(uartDmaHandle); */
                        USART_TransferAbortReceiveDMA( s_UsartAdapterBase[ uartDmaHandle->instance ],
                                                       &uartDmaHandle->dmaHandle );
                        msg.data = uartDmaHandle->dma_rx.buffer;
                        msg.status = kStatus_HAL_UartDmaIdleline;
                        uartDmaHandle->dma_rx.buffer = NULL;
                        uartDmaHandle->dma_callback( uartDmaHandle, &msg, uartDmaHandle->dma_callback_param );
                    }
                }

                /* 2, If got new data again. */
                if( ( 0U < newReceived ) && ( 0U < uartDmaHandle->dma_rx.bufferSofar ) )
                {
                    uartDmaHandle->dma_rx.timeout = 0U;
                }
            }

            uartDmaHandle = uartDmaHandle->next;
        }
    }

    hal_uart_dma_status_t HAL_UartDMAInit( hal_uart_handle_t handle,
                                           hal_uart_dma_handle_t dmaHandle,
                                           hal_uart_dma_config_t * dmaConfig )
    {
        hal_uart_state_t * uartHandle;
        hal_uart_dma_state_t * uartDmaHandle;

        assert( handle );
        assert( dmaHandle );

        /* DMA init process. */
        uartHandle = ( hal_uart_state_t * ) handle;
        uartDmaHandle = ( hal_uart_dma_state_t * ) dmaHandle;

        uartHandle->dmaHandle = uartDmaHandle;

        uartDmaHandle->instance = dmaConfig->uart_instance;

        DMA_Type * dmaBases[] = DMA_BASE_PTRS;
        DMA_EnableChannel( dmaBases[ dmaConfig->dma_instance ], dmaConfig->tx_channel );
        DMA_EnableChannel( dmaBases[ dmaConfig->dma_instance ], dmaConfig->rx_channel );

        DMA_CreateHandle( &uartDmaHandle->txDmaHandle, dmaBases[ dmaConfig->dma_instance ], dmaConfig->tx_channel );
        DMA_CreateHandle( &uartDmaHandle->rxDmaHandle, dmaBases[ dmaConfig->dma_instance ], dmaConfig->rx_channel );

        /* Timeout timer init. */
        if( 0U == s_dmaHandleList.activeCount )
        {
            s_dmaHandleList.dma_list = uartDmaHandle;
            uartDmaHandle->next = NULL;
            s_dmaHandleList.activeCount++;

            timer_status_t timerStatus;
            timerStatus = TM_Open( ( timer_handle_t ) s_dmaHandleList.timerManagerHandle );
            assert( kStatus_TimerSuccess == timerStatus );

