FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/uart/fsl_adapter_usart.c
            timerStatus =
                TM_InstallCallback( ( timer_handle_t ) s_dmaHandleList.timerManagerHandle, TimeoutTimer_Callbcak, NULL );
            assert( kStatus_TimerSuccess == timerStatus );

            ( void ) TM_Start( ( timer_handle_t ) s_dmaHandleList.timerManagerHandle, ( uint8_t ) kTimerModeIntervalTimer, 1 );

            ( void ) timerStatus;
        }
        else
        {
            uartDmaHandle->next = s_dmaHandleList.dma_list;
            s_dmaHandleList.dma_list = uartDmaHandle;
        }

        return kStatus_HAL_UartDmaSuccess;
    }

    hal_uart_dma_status_t HAL_UartDMADeinit( hal_uart_handle_t handle )
    {
        hal_uart_state_t * uartHandle;
        hal_uart_dma_state_t * uartDmaHandle;
        hal_uart_dma_state_t * prev;
        hal_uart_dma_state_t * curr;

        assert( handle );

        uartHandle = ( hal_uart_state_t * ) handle;
        uartDmaHandle = uartHandle->dmaHandle;

        uartHandle->dmaHandle = NULL;

        assert( uartDmaHandle );

        /* Abort rx/tx */
        /* Here we should not abort before create transfer handle. */
        if( NULL != uartDmaHandle->dmaHandle.txDmaHandle )
        {
            USART_TransferAbortSendDMA( s_UsartAdapterBase[ uartDmaHandle->instance ], &uartDmaHandle->dmaHandle );
        }

        if( NULL != uartDmaHandle->dmaHandle.rxDmaHandle )
        {
            USART_TransferAbortReceiveDMA( s_UsartAdapterBase[ uartDmaHandle->instance ], &uartDmaHandle->dmaHandle );
        }

        /* Disable rx/tx channels */
        /* Here we should not disable before create transfer handle. */
        if( NULL != uartDmaHandle->dmaHandle.txDmaHandle )
        {
            DMA_DisableChannel( uartDmaHandle->txDmaHandle.base, uartDmaHandle->txDmaHandle.channel );
        }

        if( NULL != uartDmaHandle->dmaHandle.rxDmaHandle )
        {
            DMA_DisableChannel( uartDmaHandle->rxDmaHandle.base, uartDmaHandle->rxDmaHandle.channel );
        }

        /* Remove handle from list */
        prev = NULL;
        curr = s_dmaHandleList.dma_list;

        while( curr != NULL )
        {
            if( curr == uartDmaHandle )
            {
                /* 1, if it is the first one */
                if( prev == NULL )
                {
                    s_dmaHandleList.dma_list = curr->next;
                }
                /* 2, if it is the last one */
                else if( curr->next == NULL )
                {
                    prev->next = NULL;
                }
                /* 3, if it is in the middle */
                else
                {
                    prev->next = curr->next;
                }

                break;
            }

            prev = curr;
            curr = curr->next;
        }

        /* Reset all handle data. */
        ( void ) memset( uartDmaHandle, 0, sizeof( hal_uart_dma_state_t ) );

        s_dmaHandleList.activeCount = ( s_dmaHandleList.activeCount > 0 ) ? ( s_dmaHandleList.activeCount - 1 ) : 0;

        if( 0 == s_dmaHandleList.activeCount )
        {
            ( void ) TM_Close( ( timer_handle_t ) s_dmaHandleList.timerManagerHandle );
        }

        return kStatus_HAL_UartDmaSuccess;
    }

    hal_uart_dma_status_t HAL_UartDMATransferInstallCallback( hal_uart_handle_t handle,
                                                              hal_uart_dma_transfer_callback_t callback,
                                                              void * callbackParam )
    {
        hal_uart_state_t * uartHandle;
        hal_uart_dma_state_t * uartDmaHandle;

        assert( handle );

        uartHandle = ( hal_uart_state_t * ) handle;
        uartDmaHandle = uartHandle->dmaHandle;

        assert( uartDmaHandle );

        uartDmaHandle->dma_callback = callback;
        uartDmaHandle->dma_callback_param = callbackParam;

        USART_TransferCreateHandleDMA( s_UsartAdapterBase[ uartDmaHandle->instance ], &uartDmaHandle->dmaHandle,
                                       USART_DMACallbacks, uartDmaHandle, &uartDmaHandle->txDmaHandle,
                                       &uartDmaHandle->rxDmaHandle );

        return kStatus_HAL_UartDmaSuccess;
    }

    hal_uart_dma_status_t HAL_UartDMATransferReceive( hal_uart_handle_t handle,
                                                      uint8_t * data,
                                                      size_t length,
                                                      bool receiveAll )
    {
        hal_uart_state_t * uartHandle;
        hal_uart_dma_state_t * uartDmaHandle;
        usart_transfer_t xfer;

        assert( handle );
        assert( data );

        uartHandle = ( hal_uart_state_t * ) handle;
        uartDmaHandle = uartHandle->dmaHandle;

        assert( uartDmaHandle );

        if( NULL == uartDmaHandle->dma_rx.buffer )
        {
            uartDmaHandle->dma_rx.buffer = data;
            uartDmaHandle->dma_rx.bufferLength = length;
            uartDmaHandle->dma_rx.timeout = 0U;
            uartDmaHandle->dma_rx.receiveAll = receiveAll;
        }
        else
        {
            /* Already in reading process. */
            return kStatus_HAL_UartDmaRxBusy;
        }

        xfer.data = data;
        xfer.dataSize = length;

        USART_TransferReceiveDMA( s_UsartAdapterBase[ uartDmaHandle->instance ], &uartDmaHandle->dmaHandle, &xfer );

        return kStatus_HAL_UartDmaSuccess;
    }

    hal_uart_dma_status_t HAL_UartDMATransferSend( hal_uart_handle_t handle,
                                                   uint8_t * data,
                                                   size_t length )
    {
        hal_uart_state_t * uartHandle;
        hal_uart_dma_state_t * uartDmaHandle;
        usart_transfer_t xfer;

        assert( handle );
        assert( data );

        uartHandle = ( hal_uart_state_t * ) handle;
        uartDmaHandle = uartHandle->dmaHandle;

        assert( uartDmaHandle );

        if( NULL == uartDmaHandle->dma_tx.buffer )
        {
            uartDmaHandle->dma_tx.buffer = data;
            uartDmaHandle->dma_tx.bufferLength = length;
            uartDmaHandle->dma_tx.bufferSofar = 0U;
            uartDmaHandle->dma_tx.timeout = 0U;
        }
        else
        {
            /* Already in writing process. */
            return kStatus_HAL_UartDmaTxBusy;
        }

        xfer.data = data;
        xfer.dataSize = length;

        USART_TransferSendDMA( s_UsartAdapterBase[ uartDmaHandle->instance ], &uartDmaHandle->dmaHandle, &xfer );

        return kStatus_HAL_UartDmaSuccess;
    }

    hal_uart_dma_status_t HAL_UartDMAGetReceiveCount( hal_uart_handle_t handle,
                                                      uint32_t * reCount )
    {
        hal_uart_state_t * uartHandle;
        hal_uart_dma_state_t * uartDmaHandle;

        assert( handle );

