FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/uart/fsl_adapter_usart.c
        uartHandle = ( hal_uart_state_t * ) handle;
        uartDmaHandle = uartHandle->dmaHandle;

        assert( uartDmaHandle );

        if( kStatus_Success != USART_TransferGetReceiveCountDMA( s_UsartAdapterBase[ uartDmaHandle->instance ],
                                                                 &uartDmaHandle->dmaHandle, reCount ) )
        {
            return kStatus_HAL_UartDmaError;
        }

        return kStatus_HAL_UartDmaSuccess;
    }

    hal_uart_dma_status_t HAL_UartDMAGetSendCount( hal_uart_handle_t handle,
                                                   uint32_t * seCount )
    {
        /* No get send count API */
        return kStatus_HAL_UartDmaError;
    }

    hal_uart_dma_status_t HAL_UartDMAAbortReceive( hal_uart_handle_t handle )
    {
        hal_uart_state_t * uartHandle;
        hal_uart_dma_state_t * uartDmaHandle;

        assert( handle );

        uartHandle = ( hal_uart_state_t * ) handle;
        uartDmaHandle = uartHandle->dmaHandle;

        assert( uartDmaHandle );

        USART_TransferAbortReceiveDMA( s_UsartAdapterBase[ uartDmaHandle->instance ], &uartDmaHandle->dmaHandle );

        return kStatus_HAL_UartDmaSuccess;
    }

    hal_uart_dma_status_t HAL_UartDMAAbortSend( hal_uart_handle_t handle )
    {
        hal_uart_state_t * uartHandle;
        hal_uart_dma_state_t * uartDmaHandle;

        assert( handle );

        uartHandle = ( hal_uart_state_t * ) handle;
        uartDmaHandle = uartHandle->dmaHandle;

        assert( uartDmaHandle );

        USART_TransferAbortSendDMA( s_UsartAdapterBase[ uartDmaHandle->instance ], &uartDmaHandle->dmaHandle );

        return kStatus_HAL_UartDmaSuccess;
    }
#endif /* HAL_UART_DMA_ENABLE */
